
## :x: Apply Failed (transactional-emails-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/78334)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
data.archive_file.events_sqs-event-consumer_lambda_lambda-default-file_DF5A641D: Reading...
data.archive_file.events_sqs-event-consumer_lambda_lambda-default-file_DF5A641D: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.aws_ssm_parameter.events_sentry-dsn_01E48A0C: Reading...
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
data.aws_ssm_parameter.events_service-hash_8328564D: Reading...
aws_sqs_queue.events_sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_E7883864: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/TransactionalEmails-Dev-Sqs-Event-Consumer-Queue-Deadletter]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
aws_sns_topic_subscription.ForgotPassword-Topic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPassword-Topic:80a70531-a39f-47fa-b530-87be258b2966]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
aws_s3_bucket.events_sqs-event-consumer_lambda_code-bucket_BDF9A5D8: Refreshing state... [id=pocket-transactionalemails-dev-sqs-event-consumer]
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.caller: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=410318598490]
data.aws_caller_identity.caller: Read complete after 0s [id=410318598490]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_iam_policy_document.events_sqs-event-consumer_lambda_assume-policy-document_BCF09A05: Reading...
data.aws_iam_policy_document.events_sqs-event-consumer_lambda_assume-policy-document_BCF09A05: Read complete after 0s [id=1349007126]
aws_sqs_queue.sns-topic-dlq: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/TransactionalEmails-Dev-SNS-Topics-DLQ]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_region.region: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
aws_codedeploy_app.events_sqs-event-consumer_lambda-code-deploy_code-deploy-app_7EC26991: Refreshing state... [id=0ae9c91d-542a-4091-b93d-caf96fc81cb6:TransactionalEmails-Dev-Sqs-Event-Consumer-Lambda]
data.aws_ssm_parameter.events_sentry-dsn_01E48A0C: Read complete after 0s [id=/TransactionalEmails/Dev/SENTRY_DSN]
data.aws_ssm_parameter.events_service-hash_8328564D: Read complete after 0s [id=/TransactionalEmails/CircleCI/Dev/SERVICE_HASH]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_iam_policy_document.events_sqs-event-consumer_lambda_execution-policy-document_CCCC8686: Reading...
aws_iam_role.events_sqs-event-consumer_lambda_execution-role_F06C65D9: Refreshing state... [id=TransactionalEmails-Dev-Sqs-Event-Consumer-ExecutionRole]
aws_sqs_queue.events_sqs-event-consumer_lambda_sqs_queue_374A86EB: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/TransactionalEmails-Dev-Sqs-Event-Consumer-Queue]
data.aws_vpc.pocket-vpc_2587E211: Reading...
data.aws_iam_policy_document.events_sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_7D86C0C0: Reading...
data.aws_iam_policy_document.events_sqs-event-consumer_lambda_execution-policy-document_CCCC8686: Read complete after 0s [id=193028123]
data.aws_iam_policy_document.events_sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_7D86C0C0: Read complete after 0s [id=4250039221]
aws_iam_policy.events_sqs-event-consumer_lambda_execution-policy_1AD3460D: Refreshing state... [id=arn:aws:iam::410318598490:policy/TransactionalEmails-Dev-Sqs-Event-Consumer-ExecutionRolePolicy]
aws_iam_role.events_sqs-event-consumer_lambda-code-deploy_code-deploy-role_4FCF08D9: Refreshing state... [id=TransactionalEmails-Dev-Sqs-Event-Consumer-CodeDeployRole]
data.aws_iam_policy_document.transactional-email-sns-dlq-policy-document: Reading...
data.aws_iam_policy_document.transactional-email-sns-dlq-policy-document: Read complete after 0s [id=1021983093]
aws_sqs_queue_policy.transactional-email-sns-dlq-policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/TransactionalEmails-Dev-SNS-Topics-DLQ]
aws_sns_topic_subscription.UserRegistrationTopic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserRegistrationTopic:6e941da9-5053-4945-bed5-a5e028e8edc2]
data.aws_iam_policy_document.events_sqs-event-consumer_lambda_sqs_policy_5106A819: Reading...
aws_sns_topic_subscription.PremiumPurchase-Topic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-PremiumPurchase-Topic:b4804758-bec5-457c-9841-fba6a701b4d9]
data.aws_iam_policy_document.events_sqs-event-consumer_lambda_sqs_policy_5106A819: Read complete after 0s [id=151400639]
aws_sns_topic_subscription.UserEventTopic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserEventTopic:09064785-cf91-4dd8-bede-b7ffc30dc7de]
data.aws_iam_policy_document.transactional-email-sns-sqs-policy-document: Reading...
data.aws_iam_policy_document.transactional-email-sns-sqs-policy-document: Read complete after 0s [id=2278903242]
aws_sqs_queue_policy.transactional-email-sns-sqs-policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/TransactionalEmails-Dev-Sqs-Event-Consumer-Queue]
aws_iam_role_policy_attachment.events_sqs-event-consumer_lambda_execution-role-policy-attachment_23784834: Refreshing state... [id=TransactionalEmails-Dev-Sqs-Event-Consumer-ExecutionRole-20220621210034568500000001]
aws_codedeploy_deployment_group.events_sqs-event-consumer_lambda-code-deploy_code-deployment-group_BF92F57F: Refreshing state... [id=0a60418b-4b2f-41ab-b64b-f6125a782f5e]
aws_iam_policy.events_sqs-event-consumer_sqs-policy_137E47FC: Refreshing state... [id=arn:aws:iam::410318598490:policy/TransactionalEmails-Dev-Sqs-Event-Consumer-LambdaSQSPolicy]
aws_iam_role_policy_attachment.events_sqs-event-consumer_lambda-code-deploy_code-deploy-policy-attachment_82779A66: Refreshing state... [id=TransactionalEmails-Dev-Sqs-Event-Consumer-CodeDeployRole-20220621210034572300000002]
aws_s3_bucket_public_access_block.events_sqs-event-consumer_lambda_code-bucket-public-access-block_B193BBE0: Refreshing state... [id=pocket-transactionalemails-dev-sqs-event-consumer]
aws_s3_bucket_ownership_controls.events_sqs-event-consumer_lambda_code-bucket-ownership-controls_EB225FF5: Refreshing state... [id=pocket-transactionalemails-dev-sqs-event-consumer]
aws_iam_role_policy_attachment.events_sqs-event-consumer_execution-role-policy-attachment_6987CDBE: Refreshing state... [id=TransactionalEmails-Dev-Sqs-Event-Consumer-ExecutionRole-20220621210124760800000003]
aws_s3_bucket_acl.events_sqs-event-consumer_lambda_code-bucket-acl_F4DBF6D5: Refreshing state... [id=pocket-transactionalemails-dev-sqs-event-consumer,private]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 0s [id=vpc-012481e83ffa5e152]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 1s [id=us-east-1]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 1s [id=us-east-1]
aws_lambda_function.events_sqs-event-consumer_lambda_3BE960B8: Refreshing state... [id=TransactionalEmails-Dev-Sqs-Event-Consumer-Function]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 1s [id=us-east-1]
aws_cloudwatch_log_group.events_sqs-event-consumer_lambda_log-group_BD35528B: Refreshing state... [id=/aws/lambda/TransactionalEmails-Dev-Sqs-Event-Consumer-Function]
aws_lambda_alias.events_sqs-event-consumer_lambda_alias_0C07F112: Refreshing state... [id=arn:aws:lambda:us-east-1:410318598490:function:TransactionalEmails-Dev-Sqs-Event-Consumer-Function:DEPLOYED]
aws_cloudwatch_metric_alarm.events_sqs-event-consumer_errors_D9533157: Refreshing state... [id=TransactionalEmails-Dev-Sqs-Event-Consumer-Lambda-Errors-Alarm]
aws_lambda_event_source_mapping.events_sqs-event-consumer_lambda_event_source_mapping_6A1F717A: Refreshing state... [id=ba870d0e-a1e0-49d9-9b28-de9dd9520c7a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_lambda_function.events_sqs-event-consumer_lambda_3BE960B8 will be updated in-place
  ~ resource "aws_lambda_function" "events_sqs-event-consumer_lambda_3BE960B8" {
        id                             = "TransactionalEmails-Dev-Sqs-Event-Consumer-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:410318598490:function:TransactionalEmails-Dev-Sqs-Event-Consumer-Function:237" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:410318598490:function:TransactionalEmails-Dev-Sqs-Event-Consumer-Function:237/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Dev"
            "service"     = "TransactionalEmails"
        }
      ~ version                        = "237" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"                            = (sensitive value)
                # (7 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_sns_topic_subscription.ForgotPassword-Topic-sns-subscription will be destroyed
  # (because aws_sns_topic_subscription.ForgotPassword-Topic-sns-subscription is not in configuration)
  - resource "aws_sns_topic_subscription" "ForgotPassword-Topic-sns-subscription" {
      - arn                             = "arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPassword-Topic:80a70531-a39f-47fa-b530-87be258b2966" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:sqs:us-east-1:410318598490:TransactionalEmails-Dev-Sqs-Event-Consumer-Queue" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPassword-Topic:80a70531-a39f-47fa-b530-87be258b2966" -> null
      - owner_id                        = "410318598490" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "sqs" -> null
      - raw_message_delivery            = false -> null
      - redrive_policy                  = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:us-east-1:410318598490:TransactionalEmails-Dev-SNS-Topics-DLQ"
            }
        ) -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPassword-Topic" -> null
    }

  # aws_sns_topic_subscription.ForgotPasswordRequest-Topic-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "ForgotPasswordRequest-Topic-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:410318598490:TransactionalEmails-Dev-Sqs-Event-Consumer-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:410318598490:TransactionalEmails-Dev-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPasswordRequest-Topic"
    }

  # aws_sqs_queue_policy.transactional-email-sns-dlq-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "transactional-email-sns-dlq-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/410318598490/TransactionalEmails-Dev-SNS-Topics-DLQ"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:SourceArn" = [
                                    # (2 unchanged elements hidden)
                                    "arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserRegistrationTopic",
                                  - "arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPassword-Topic",
                                  + "arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPasswordRequest-Topic",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.transactional-email-sns-sqs-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "transactional-email-sns-sqs-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/410318598490/TransactionalEmails-Dev-Sqs-Event-Consumer-Queue"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:SourceArn" = [
                                    # (2 unchanged elements hidden)
                                    "arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserRegistrationTopic",
                                  - "arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPassword-Topic",
                                  + "arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPasswordRequest-Topic",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
aws_sns_topic_subscription.ForgotPassword-Topic-sns-subscription: Destroying... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-ForgotPassword-Topic:80a70531-a39f-47fa-b530-87be258b2966]
aws_sns_topic_subscription.ForgotPasswordRequest-Topic-sns-subscription: Creating...
aws_sqs_queue_policy.transactional-email-sns-sqs-policy: Modifying... [id=https://sqs.us-east-1.amazonaws.com/410318598490/TransactionalEmails-Dev-Sqs-Event-Consumer-Queue]
aws_sqs_queue_policy.transactional-email-sns-dlq-policy: Modifying... [id=https://sqs.us-east-1.amazonaws.com/410318598490/TransactionalEmails-Dev-SNS-Topics-DLQ]
aws_lambda_function.events_sqs-event-consumer_lambda_3BE960B8: Modifying... [id=TransactionalEmails-Dev-Sqs-Event-Consumer-Function]
aws_sns_topic_subscription.ForgotPassword-Topic-sns-subscription: Destruction complete after 0s
aws_lambda_function.events_sqs-event-consumer_lambda_3BE960B8: Modifications complete after 7s [id=TransactionalEmails-Dev-Sqs-Event-Consumer-Function]
aws_sqs_queue_policy.transactional-email-sns-sqs-policy: Still modifying... [id=https://sqs.us-east-1.amazonaws.com/410...nalEmails-Dev-Sqs-Event-Consumer-Queue, 10s elapsed]
aws_sqs_queue_policy.transactional-email-sns-dlq-policy: Still modifying... [id=https://sqs.us-east-1.amazonaws.com/410...TransactionalEmails-Dev-SNS-Topics-DLQ, 10s elapsed]
aws_sqs_queue_policy.transactional-email-sns-sqs-policy: Still modifying... [id=https://sqs.us-east-1.amazonaws.com/410...nalEmails-Dev-Sqs-Event-Consumer-Queue, 20s elapsed]
aws_sqs_queue_policy.transactional-email-sns-dlq-policy: Still modifying... [id=https://sqs.us-east-1.amazonaws.com/410...TransactionalEmails-Dev-SNS-Topics-DLQ, 20s elapsed]
aws_sqs_queue_policy.transactional-email-sns-sqs-policy: Modifications complete after 25s [id=https://sqs.us-east-1.amazonaws.com/410318598490/TransactionalEmails-Dev-Sqs-Event-Consumer-Queue]
aws_sqs_queue_policy.transactional-email-sns-dlq-policy: Modifications complete after 25s [id=https://sqs.us-east-1.amazonaws.com/410318598490/TransactionalEmails-Dev-SNS-Topics-DLQ]
╷
│ Error: creating SNS Topic Subscription: operation error SNS: Subscribe, https response error StatusCode: 404, RequestID: ae7baa52-0ff4-5dee-805c-f43b320cc48f, NotFound: Topic does not exist
│ 
│   with aws_sns_topic_subscription.ForgotPasswordRequest-Topic-sns-subscription,
│   on cdk.tf.json line 817, in resource.aws_sns_topic_subscription.ForgotPasswordRequest-Topic-sns-subscription:
│  817:       },
│ 
╵

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"daad1aca-2f25-497a-8b97-89b8bec2b6d2","JobName":"transactional-emails_infrastructure_apply_dev","PRNumber":249,"Program":"tfcmt","SHA1":"01b0b9755351243e5084273feca126509bb47a86","Target":"transactional-emails-cdk-dev","Vars":{}} -->